openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/bus/esp_panel_bus_rgb.cpp
/*
 * SPDX-FileCopyrightText: 2023-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include "esp_panel_bus_conf_internal.h"
#if ESP_PANEL_DRIVERS_BUS_ENABLE_RGB

#include <cstdlib>
#include <cstring>
#include "esp_lcd_panel_io.h"
#include "utils/esp_panel_utils_log.h"
#include "esp_panel_bus_rgb.hpp"

namespace esp_panel::drivers {

void BusRGB::Config::convertPartialToFull()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    if (isControlPanelValid() && std::holds_alternative<ControlPanelPartialConfig>(control_panel.value())) {
#if ESP_UTILS_CONF_LOG_LEVEL == ESP_UTILS_LOG_LEVEL_DEBUG
        printControlPanelConfig();
#endif // ESP_UTILS_LOG_LEVEL_DEBUG
        auto &config = std::get<ControlPanelPartialConfig>(control_panel.value());
        control_panel =  ControlPanelFullConfig{
            .line_config = {
                .cs_io_type = static_cast<panel_io_type_t>(config.cs_io_type),
                .cs_gpio_num = config.cs_gpio_num,
                .scl_io_type = static_cast<panel_io_type_t>(config.scl_io_type),
                .scl_gpio_num = config.scl_gpio_num,
                .sda_io_type = static_cast<panel_io_type_t>(config.sda_io_type),
                .sda_gpio_num = config.sda_gpio_num,
            },
            .expect_clk_speed = PANEL_IO_SPI_CLK_MAX,
            .spi_mode = static_cast<uint32_t>(config.spi_mode),
            .lcd_cmd_bytes = static_cast<uint32_t>(config.lcd_cmd_bytes),
            .lcd_param_bytes = static_cast<uint32_t>(config.lcd_param_bytes),
            .flags = {
                .use_dc_bit = static_cast<uint32_t>(config.flags_use_dc_bit),
                .dc_zero_on_data = 0,
                .lsb_first = 0,
                .cs_high_active = 0,
                .del_keep_cs_inactive = 1,
            },
        };
    }

    if (std::holds_alternative<RefreshPanelPartialConfig>(refresh_panel)) {
#if ESP_UTILS_CONF_LOG_LEVEL == ESP_UTILS_LOG_LEVEL_DEBUG
        printRefreshPanelConfig();
#endif // ESP_UTILS_LOG_LEVEL_DEBUG
        auto &config = std::get<RefreshPanelPartialConfig>(refresh_panel);
        refresh_panel = RefreshPanelFullConfig{
            .clk_src = LCD_CLK_SRC_DEFAULT,
            .timings = {
                .pclk_hz = static_cast<uint32_t>(config.pclk_hz),
                .h_res = static_cast<uint32_t>(config.h_res),
                .v_res = static_cast<uint32_t>(config.v_res),
                .hsync_pulse_width = static_cast<uint32_t>(config.hsync_pulse_width),
                .hsync_back_porch = static_cast<uint32_t>(config.hsync_back_porch),
                .hsync_front_porch = static_cast<uint32_t>(config.hsync_front_porch),
                .vsync_pulse_width = static_cast<uint32_t>(config.vsync_pulse_width),
                .vsync_back_porch = static_cast<uint32_t>(config.vsync_back_porch),
                .vsync_front_porch = static_cast<uint32_t>(config.vsync_front_porch),
                .flags = {
                    .hsync_idle_low = 0,
                    .vsync_idle_low = 0,
                    .de_idle_high = 0,
                    .pclk_active_neg = config.flags_pclk_active_neg,
                    .pclk_idle_high = 0,
                },
            },
            .data_width = static_cast<size_t>(config.data_width),
            .bits_per_pixel = static_cast<size_t>(config.bits_per_pixel),
            .num_fbs = 1,
            .bounce_buffer_size_px = static_cast<size_t>(config.bounce_buffer_size_px),
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
            .dma_burst_size = 64,
#else
            .sram_trans_align = 4,
            .psram_trans_align = 64,
#endif // ESP_IDF_VERSION
            .hsync_gpio_num = config.hsync_gpio_num,
            .vsync_gpio_num = config.vsync_gpio_num,
            .de_gpio_num = config.de_gpio_num,
            .pclk_gpio_num = config.pclk_gpio_num,
            .disp_gpio_num = config.disp_gpio_num,
            .data_gpio_nums = {
                config.data_gpio_nums[0], config.data_gpio_nums[1],
                config.data_gpio_nums[2], config.data_gpio_nums[3],
                config.data_gpio_nums[4], config.data_gpio_nums[5],
                config.data_gpio_nums[6], config.data_gpio_nums[7],
#if ESP_PANEL_BUS_RGB_DATA_BITS >= 16
                config.data_gpio_nums[8], config.data_gpio_nums[9],
                config.data_gpio_nums[10], config.data_gpio_nums[11],
                config.data_gpio_nums[12], config.data_gpio_nums[13],
                config.data_gpio_nums[14], config.data_gpio_nums[15],
#endif // ESP_PANEL_BUS_RGB_DATA_BITS
            },
            .flags = {
                .disp_active_low = 0,
                .refresh_on_demand = 0,
                .fb_in_psram = 1,
                .double_fb = 0,
                .no_fb = 0,
                .bb_invalidate_cache = 0,
            },
        };
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();
}

void BusRGB::Config::printControlPanelConfig() const
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    if (!isControlPanelValid()) {
        ESP_UTILS_LOGI("\n\t{Control panel config}[skipped]");
        goto end;
    }

    if (std::holds_alternative<ControlPanelFullConfig>(control_panel.value())) {
        auto &config = std::get<ControlPanelFullConfig>(control_panel.value());
        ESP_UTILS_LOGI(
            "\n\t{Control panel config}[full]"
            "\n\t\t-> {line_config}"
            "\n\t\t\t-> [cs_io_type]: %d"
            "\n\t\t\t-> [cs_gpio_num]: %d"
            "\n\t\t\t-> [scl_io_type]: %d"
            "\n\t\t\t-> [scl_gpio_num]: %d"
            "\n\t\t\t-> [sda_io_type]: %d"
            "\n\t\t\t-> [sda_gpio_num]: %d"
            , static_cast<int>(config.line_config.cs_io_type)
            , static_cast<int>(config.line_config.cs_gpio_num)
            , static_cast<int>(config.line_config.scl_io_type)
            , static_cast<int>(config.line_config.scl_gpio_num)
            , static_cast<int>(config.line_config.sda_io_type)
            , static_cast<int>(config.line_config.sda_gpio_num)
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> [expect_clk_speed]: %d"
            "\n\t\t-> [spi_mode]: %d"
            "\n\t\t-> [lcd_cmd_bytes]: %d"
            "\n\t\t-> [lcd_param_bytes]: %d"
            , static_cast<int>(config.expect_clk_speed)
            , static_cast<int>(config.spi_mode)
            , static_cast<int>(config.lcd_cmd_bytes)
            , static_cast<int>(config.lcd_param_bytes)
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> {flags}"
            "\n\t\t\t-> [use_dc_bit]: %d"
            "\n\t\t\t-> [dc_zero_on_data]: %d"
            "\n\t\t\t-> [lsb_first]: %d"
            "\n\t\t\t-> [cs_high_active]: %d"
            "\n\t\t\t-> [del_keep_cs_inactive]: %d"
            , static_cast<int>(config.flags.use_dc_bit)
            , static_cast<int>(config.flags.dc_zero_on_data)
            , static_cast<int>(config.flags.lsb_first)
            , static_cast<int>(config.flags.cs_high_active)
            , static_cast<int>(config.flags.del_keep_cs_inactive)
        );
    } else {
        auto &config = std::get<ControlPanelPartialConfig>(control_panel.value());
        ESP_UTILS_LOGI(
            "\n\t{Control panel config}[partial]"
            "\n\t\t-> [cs_io_type]: %d"
            "\n\t\t-> [cs_gpio_num]: %d"
            "\n\t\t-> [scl_io_type]: %d"
            "\n\t\t-> [scl_gpio_num]: %d"
            "\n\t\t-> [sda_io_type]: %d"
            "\n\t\t-> [sda_gpio_num]: %d"
            , static_cast<int>(config.cs_io_type)
            , static_cast<int>(config.cs_gpio_num)
            , static_cast<int>(config.scl_io_type)
            , static_cast<int>(config.scl_gpio_num)
            , static_cast<int>(config.sda_io_type)
            , static_cast<int>(config.sda_gpio_num)
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> [spi_mode]: %d"
            "\n\t\t-> [lcd_cmd_bytes]: %d"
            "\n\t\t-> [lcd_param_bytes]: %d"
            "\n\t\t-> [flags_use_dc_bit]: %d"
            , static_cast<int>(config.spi_mode)
            , static_cast<int>(config.lcd_cmd_bytes)
            , static_cast<int>(config.lcd_param_bytes)
            , static_cast<int>(config.flags_use_dc_bit)
        );
    }

end:
    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();
}

