openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/bus/esp_panel_bus_rgb.cpp
void BusRGB::Config::printRefreshPanelConfig() const
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    if (std::holds_alternative<RefreshPanelFullConfig>(refresh_panel)) {
        auto &config = std::get<RefreshPanelFullConfig>(refresh_panel);
        ESP_UTILS_LOGI(
            "\n\t{Refresh panel config}[full]"
            "\n\t\t-> [clk_src]: %d"
            , static_cast<int>(config.clk_src)
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> {timings}"
            "\n\t\t\t-> [pclk_hz]: %d"
            "\n\t\t\t-> [h_res]: %d"
            "\n\t\t\t-> [v_res]: %d"
            "\n\t\t\t-> [hsync_pulse_width]: %d"
            "\n\t\t\t-> [hsync_back_porch]: %d"
            , static_cast<int>(config.timings.pclk_hz)
            , static_cast<int>(config.timings.h_res)
            , static_cast<int>(config.timings.v_res)
            , static_cast<int>(config.timings.hsync_pulse_width)
            , static_cast<int>(config.timings.hsync_back_porch)
        );
        ESP_UTILS_LOGI(
            "\n\t\t\t-> [hsync_front_porch]: %d"
            "\n\t\t\t-> [vsync_pulse_width]: %d"
            "\n\t\t\t-> [vsync_back_porch]: %d"
            "\n\t\t\t-> [vsync_front_porch]: %d"
            , static_cast<int>(config.timings.hsync_front_porch)
            , static_cast<int>(config.timings.vsync_pulse_width)
            , static_cast<int>(config.timings.vsync_back_porch)
            , static_cast<int>(config.timings.vsync_front_porch)
        );
        ESP_UTILS_LOGI(
            "\n\t\t\t-> {flags}"
            "\n\t\t\t\t-> [hsync_idle_low]: %d"
            "\n\t\t\t\t-> [vsync_idle_low]: %d"
            "\n\t\t\t\t-> [de_idle_high]: %d"
            "\n\t\t\t\t-> [pclk_active_neg]: %d"
            "\n\t\t\t\t-> [pclk_idle_high]: %d"
            , static_cast<int>(config.timings.flags.hsync_idle_low)
            , static_cast<int>(config.timings.flags.vsync_idle_low)
            , static_cast<int>(config.timings.flags.de_idle_high)
            , static_cast<int>(config.timings.flags.pclk_active_neg)
            , static_cast<int>(config.timings.flags.pclk_idle_high)
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> [data_width]: %d"
            "\n\t\t-> [bits_per_pixel]: %d"
            "\n\t\t-> [num_fbs]: %d"
            "\n\t\t-> [bounce_buffer_size_px]: %d"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
            "\n\t\t-> [dma_burst_size]: %d"
#else
            "\n\t\t-> [sram_trans_align]: %d"
            "\n\t\t-> [psram_trans_align]: %d"
#endif // ESP_IDF_VERSION
            "\n\t\t-> [hsync_gpio_num]: %d"
            "\n\t\t-> [vsync_gpio_num]: %d"
            "\n\t\t-> [de_gpio_num]: %d"
            "\n\t\t-> [pclk_gpio_num]: %d"
            "\n\t\t-> [disp_gpio_num]: %d"
            , static_cast<int>(config.data_width)
            , static_cast<int>(config.bits_per_pixel)
            , static_cast<int>(config.num_fbs)
            , static_cast<int>(config.bounce_buffer_size_px)
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
            , static_cast<int>(config.dma_burst_size)
#else
            , static_cast<int>(config.sram_trans_align)
            , static_cast<int>(config.psram_trans_align)
#endif // ESP_IDF_VERSION
            , static_cast<int>(config.hsync_gpio_num)
            , static_cast<int>(config.vsync_gpio_num)
            , static_cast<int>(config.de_gpio_num)
            , static_cast<int>(config.pclk_gpio_num)
            , static_cast<int>(config.disp_gpio_num)
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> {data_gpio_nums}"
            "\n\t\t\t-> [0-7]: %d, %d, %d, %d, %d, %d, %d, %d"
#if ESP_PANEL_BUS_RGB_DATA_BITS >= 16
            "\n\t\t\t-> [8-15]: %d, %d, %d, %d, %d, %d, %d, %d"
#endif // ESP_PANEL_BUS_RGB_DATA_BITS
            , config.data_gpio_nums[0], config.data_gpio_nums[1], config.data_gpio_nums[2], config.data_gpio_nums[3]
            , config.data_gpio_nums[4], config.data_gpio_nums[5], config.data_gpio_nums[6], config.data_gpio_nums[7]
#if ESP_PANEL_BUS_RGB_DATA_BITS >= 16
            , config.data_gpio_nums[8], config.data_gpio_nums[9], config.data_gpio_nums[10], config.data_gpio_nums[11]
            , config.data_gpio_nums[12], config.data_gpio_nums[13], config.data_gpio_nums[14], config.data_gpio_nums[15]
#endif // ESP_PANEL_BUS_RGB_DATA_BITS
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> {flags}"
            "\n\t\t\t-> [disp_active_low]: %d"
            "\n\t\t\t-> [refresh_on_demand]: %d"
            "\n\t\t\t-> [fb_in_psram]: %d"
            "\n\t\t\t-> [double_fb]: %d"
            "\n\t\t\t-> [no_fb]: %d"
            "\n\t\t\t-> [bb_invalidate_cache]: %d"
            , static_cast<int>(config.flags.disp_active_low)
            , static_cast<int>(config.flags.refresh_on_demand)
            , static_cast<int>(config.flags.fb_in_psram)
            , static_cast<int>(config.flags.double_fb)
            , static_cast<int>(config.flags.no_fb)
            , static_cast<int>(config.flags.bb_invalidate_cache)
        );
    } else {
        auto &config = std::get<RefreshPanelPartialConfig>(refresh_panel);
        ESP_UTILS_LOGI(
            "\n\t{Refresh panel config}[partial]"
            "\n\t\t-> [pclk_hz]: %d"
            "\n\t\t-> [h_res]: %d"
            "\n\t\t-> [v_res]: %d"
            , static_cast<int>(config.pclk_hz)
            , static_cast<int>(config.h_res)
            , static_cast<int>(config.v_res)
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> [hsync_pulse_width]: %d"
            "\n\t\t-> [hsync_back_porch]: %d"
            "\n\t\t-> [hsync_front_porch]: %d"
            "\n\t\t-> [vsync_pulse_width]: %d"
            "\n\t\t-> [vsync_back_porch]: %d"
            "\n\t\t-> [vsync_front_porch]: %d"
            , static_cast<int>(config.hsync_pulse_width)
            , static_cast<int>(config.hsync_back_porch)
            , static_cast<int>(config.hsync_front_porch)
            , static_cast<int>(config.vsync_pulse_width)
            , static_cast<int>(config.vsync_back_porch)
            , static_cast<int>(config.vsync_front_porch)
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> [data_width]: %d"
            "\n\t\t-> [bits_per_pixel]: %d"
            "\n\t\t-> [bounce_buffer_size_px]: %d"
            "\n\t\t-> [hsync_gpio_num]: %d"
            "\n\t\t-> [vsync_gpio_num]: %d"
            "\n\t\t-> [de_gpio_num]: %d"
            "\n\t\t-> [pclk_gpio_num]: %d"
            "\n\t\t-> [disp_gpio_num]: %d"
            , static_cast<int>(config.data_width)
            , static_cast<int>(config.bits_per_pixel)
            , static_cast<int>(config.bounce_buffer_size_px)
            , static_cast<int>(config.hsync_gpio_num)
            , static_cast<int>(config.vsync_gpio_num)
            , static_cast<int>(config.de_gpio_num)
            , static_cast<int>(config.pclk_gpio_num)
            , static_cast<int>(config.disp_gpio_num)
        );
        ESP_UTILS_LOGI(
            "\n\t\t-> {data_gpio_nums}"
            "\n\t\t\t-> [0-7]: %d, %d, %d, %d, %d, %d, %d, %d"
#if ESP_PANEL_BUS_RGB_DATA_BITS >= 16
            "\n\t\t\t-> [8-15]: %d, %d, %d, %d, %d, %d, %d, %d"
#endif // ESP_PANEL_BUS_RGB_DATA_BITS
            "\n\t\t-> [flags_pclk_active_neg]: %d"
            , config.data_gpio_nums[0], config.data_gpio_nums[1], config.data_gpio_nums[2], config.data_gpio_nums[3]
            , config.data_gpio_nums[4], config.data_gpio_nums[5], config.data_gpio_nums[6], config.data_gpio_nums[7]
#if ESP_PANEL_BUS_RGB_DATA_BITS >= 16
            , config.data_gpio_nums[8], config.data_gpio_nums[9], config.data_gpio_nums[10], config.data_gpio_nums[11]
            , config.data_gpio_nums[12], config.data_gpio_nums[13], config.data_gpio_nums[14], config.data_gpio_nums[15]
#endif // ESP_PANEL_BUS_RGB_DATA_BITS
            , static_cast<int>(config.flags_pclk_active_neg)
        );
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();
}

BusRGB::~BusRGB()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_EXIT(del(), "Delete failed");

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();
}

bool BusRGB::configSPI_IO_Type(bool cs_use_expander, bool sck_use_expander, bool sda_use_expander)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

