openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/bus/esp_panel_bus_rgb.cpp
    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isControlPanelUsed(), false, "Not using control panel");

    ESP_UTILS_LOGD(
        "Param: cs_use_expander(%d), sck_use_expander(%d), sda_use_expander(%d)",
        cs_use_expander, sck_use_expander, sda_use_expander
    );
    auto &config = getControlPanelFullConfig();
    if (cs_use_expander) {
        if (config.line_config.cs_io_type == IO_TYPE_GPIO) {
            config.line_config.cs_expander_pin = (esp_io_expander_pin_num_t)BIT(config.line_config.cs_gpio_num);
        }
        config.line_config.cs_io_type = IO_TYPE_EXPANDER;
    }
    if (sck_use_expander) {
        if (config.line_config.scl_io_type == IO_TYPE_GPIO) {
            config.line_config.scl_expander_pin = (esp_io_expander_pin_num_t)BIT(config.line_config.scl_gpio_num);
        }
        config.line_config.scl_io_type = IO_TYPE_EXPANDER;
    }
    if (sda_use_expander) {
        if (config.line_config.sda_io_type == IO_TYPE_GPIO) {
            config.line_config.sda_expander_pin = (esp_io_expander_pin_num_t)BIT(config.line_config.sda_gpio_num);
        }
        config.line_config.sda_io_type = IO_TYPE_EXPANDER;
    }

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configSPI_IO_Expander(esp_io_expander_t *handle)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isControlPanelUsed(), false, "Not using control panel");

    ESP_UTILS_LOGD("Param: handle(@%p)", handle);
    getControlPanelFullConfig().line_config.io_expander = handle;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configSPI_Mode(uint8_t mode)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isControlPanelUsed(), false, "Not using control panel");

    ESP_UTILS_LOGD("Param: mode(%d)", mode);
    getControlPanelFullConfig().spi_mode = mode;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configSPI_CommandDataBytes(uint8_t command_bytes, uint8_t data_bytes)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");
    ESP_UTILS_CHECK_FALSE_RETURN(isControlPanelUsed(), false, "Not using control panel");

    ESP_UTILS_LOGD("Param: command_bytes(%d), data_bytes(%d)", command_bytes, data_bytes);
    getControlPanelFullConfig().lcd_cmd_bytes = command_bytes;
    getControlPanelFullConfig().lcd_param_bytes = data_bytes;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configRGB_FreqHz(uint32_t hz)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");

    ESP_UTILS_LOGD("Param: hz(%d)", static_cast<int>(hz));
    getRefreshPanelFullConfig().timings.pclk_hz = hz;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configRGB_FrameBufferNumber(uint8_t num)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Should be called before `init()`");

    ESP_UTILS_LOGD("Param: num(%d)", num);
    ESP_UTILS_CHECK_FALSE_RETURN(num > 0, false, "Frame buffer number must be greater than 0");
    getRefreshPanelFullConfig().num_fbs = num;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configRGB_BounceBufferSize(uint32_t size_in_pixel)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(
        !isOverState(State::INIT), false, "Should be called before `init()`"
    );

    ESP_UTILS_LOGD("Param: size_in_pixel(%d)", static_cast<int>(size_in_pixel));

    auto &config = getRefreshPanelFullConfig();
    uint32_t half_total_pixels = config.timings.h_res * config.timings.v_res / 2;

    // Check if half_total_pixels is divisible by size_in_pixel
    if (half_total_pixels % size_in_pixel != 0) {
        // Find next valid size by incrementing until we find one that works
        uint32_t new_size = size_in_pixel;
        while (new_size <= half_total_pixels) {
            if (half_total_pixels % new_size == 0) {
                ESP_UTILS_LOGW(
                    "Adjusted bounce buffer size from %d to %d pixels to ensure proper alignment",
                    static_cast<int>(size_in_pixel), static_cast<int>(new_size)
                );
                size_in_pixel = new_size;
                break;
            }
            new_size++;
        }

        ESP_UTILS_CHECK_FALSE_RETURN(new_size <= half_total_pixels, false, "Could not find valid bounce buffer size");
    }

    config.bounce_buffer_size_px = size_in_pixel;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configRGB_TimingFlags(
    bool hsync_idle_low, bool vsync_idle_low, bool de_idle_high, bool pclk_active_neg, bool pclk_idle_high
)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(
        !isOverState(State::INIT), false, "Should be called before `init()`"
    );

    ESP_UTILS_LOGD(
        "Param: hsync_idle_low(%d), vsync_idle_low(%d), de_idle_high(%d), pclk_active_neg(%d), pclk_idle_high(%d)",
        hsync_idle_low, vsync_idle_low, de_idle_high, pclk_active_neg, pclk_idle_high
    );
    auto &config = getRefreshPanelFullConfig();
    config.timings.flags.hsync_idle_low = hsync_idle_low;
    config.timings.flags.vsync_idle_low = vsync_idle_low;
    config.timings.flags.de_idle_high = de_idle_high;
    config.timings.flags.pclk_active_neg = pclk_active_neg;
    config.timings.flags.pclk_idle_high = pclk_idle_high;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configSpiLine(
    bool cs_use_expander, bool sck_use_expander, bool sda_use_expander, esp_expander::Base *io_expander
)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(
        !isOverState(State::INIT), false, "Should be called before `init()`"
    );

