openshwprojects/OpenBK7231T_App/src/libraries/ESP32_Display_Panel/src/drivers/bus/esp_panel_bus_rgb.cpp
    ESP_UTILS_LOGD(
        "Param: cs_use_expander(%d), sck_use_expander(%d), sda_use_expander(%d), io_expander(@%p)",
        cs_use_expander, sck_use_expander, sda_use_expander, io_expander
    );
    ESP_UTILS_CHECK_FALSE_RETURN(
        configSPI_IO_Expander(io_expander->getDeviceHandle()), false, "config SPI IO expander failed"
    );
    ESP_UTILS_CHECK_FALSE_RETURN(
        configSPI_IO_Type(cs_use_expander, sck_use_expander, sda_use_expander), false, "config SPI IO type failed"
    );

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configRgbFlagDispActiveLow()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(
        !isOverState(State::INIT), false, "Should be called before `init()`"
    );

    getRefreshPanelFullConfig().flags.disp_active_low = 1;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configRgbTimingFreqHz(uint32_t hz)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(
        !isOverState(State::INIT), false, "Should be called before `init()`"
    );

    ESP_UTILS_LOGD("Param: hz(%d)", (int)hz);
    getRefreshPanelFullConfig().timings.pclk_hz = hz;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::configRgbTimingPorch(
    uint16_t hpw, uint16_t hbp, uint16_t hfp, uint16_t vpw, uint16_t vbp, uint16_t vfp
)
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(
        !isOverState(State::INIT), false, "Should be called before `init()`"
    );

    ESP_UTILS_LOGD("Param: hpw(%d), hbp(%d), hfp(%d), vpw(%d), vbp(%d), vfp(%d)", hpw, hbp, hfp, vpw, vbp, vfp);
    auto &config = getRefreshPanelFullConfig();
    config.timings.hsync_pulse_width = hpw;
    config.timings.hsync_back_porch = hbp;
    config.timings.hsync_front_porch = hfp;
    config.timings.vsync_pulse_width = vpw;
    config.timings.vsync_back_porch = vbp;
    config.timings.vsync_front_porch = vfp;

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::init()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::INIT), false, "Already initialized");

    // Convert the partial configuration to full configuration
    _config.convertPartialToFull();
#if ESP_UTILS_CONF_LOG_LEVEL == ESP_UTILS_LOG_LEVEL_DEBUG
    _config.printControlPanelConfig();
    _config.printRefreshPanelConfig();
#endif // ESP_UTILS_LOG_LEVEL_DEBUG

    setState(State::INIT);

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::begin()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    ESP_UTILS_CHECK_FALSE_RETURN(!isOverState(State::BEGIN), false, "Already begun");

    // Initialize the bus if not initialized
    if (!isOverState(State::INIT)) {
        ESP_UTILS_CHECK_FALSE_RETURN(init(), false, "Init failed");
    }

    // Create the control panel if needed
    if (isControlPanelUsed()) {
        ESP_UTILS_CHECK_ERROR_RETURN(
            esp_lcd_new_panel_io_3wire_spi(&getControlPanelFullConfig(), &control_panel), false,
            "create control panel failed"
        );
        ESP_UTILS_LOGD("Create control panel @%p", control_panel);
    }

    setState(State::BEGIN);

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

bool BusRGB::del()
{
    ESP_UTILS_LOG_TRACE_ENTER_WITH_THIS();

    // Delete the control panel if valid
    if (isControlPanelUsed() && isControlPanelValid()) {
        ESP_UTILS_CHECK_FALSE_RETURN(delControlPanel(), false, "Delete control panel failed");
    }

    setState(State::DEINIT);

    ESP_UTILS_LOG_TRACE_EXIT_WITH_THIS();

    return true;
}

BusRGB::ControlPanelFullConfig &BusRGB::getControlPanelFullConfig()
{
    if (std::holds_alternative<ControlPanelPartialConfig>(_config.control_panel.value())) {
        _config.convertPartialToFull();
    }

    return std::get<ControlPanelFullConfig>(_config.control_panel.value());
}

BusRGB::RefreshPanelFullConfig &BusRGB::getRefreshPanelFullConfig()
{
    if (std::holds_alternative<RefreshPanelPartialConfig>(_config.refresh_panel)) {
        _config.convertPartialToFull();
    }

    return std::get<RefreshPanelFullConfig>(_config.refresh_panel);
}

} // namespace esp_panel::drivers

#endif // ESP_PANEL_DRIVERS_BUS_ENABLE_RGB
